[
    {
        "name": "Google",
        "children": [
            {
                "year": 1998,
                "image": "ZbpTlwyh.png",
                "desc": "This is the first version of Google that can be found online. It encapsulates the style of the early internet with its 3D word art logo and colorful, non-symmetric tables. Though, this page still very much resembles what we see today, especially with the iconic \"I'm feeling lucky\" button."
            },
            {
                "year": 2001,
                "image": "l0WSSBq1.png",
                "desc": "This version of Google shows the start of modernization. As the internet started to grow and design became more important, the page has been simplified, though, remnants of Google's original 3D Word art logo remain as well as a few positional adjustments, like \"Advanced Search\" being to the right of the search bar."
            },
            {
                "year": 2004,
                "image": "PdYfhgfn.png",
                "desc": "The design of Google starts to remain pretty consistent at this point. However, a trend of simplifying the page starts to emerge. Several buttons were completely removed as well as any text coloring besides the now-standard blue links and black text."
            },
            {
                "year": 2010,
                "image": "a2GdTgMI.png",
                "desc": "Though Google's logo still has some depth to it, it has been further simplified and looks more 2D than ever before. Additionally, everything has grown slightly bigger and spaced out, allowing people to click the buttons easier. Shadows have also been added to everything to make the page more sleek and realistic, though not much has changed in the layout for a decade now."
            },
            {
                "year": 2014,
                "image": "xItVOHDX.png",
                "desc": "2014 gives us the first instance of the completely flattened Google logo that we're more familiar with today. It took 15 years of slowly losing all depth, but it has finally reached it this year. Additionally, the task bar in the top is changed to have a dark background, contrasting with the rest of the page instead of popping out with all its blue links, but those are about the only significant changes this year."
            },
            {
                "year": 2017,
                "image": "Zc6V3jgp.png",
                "desc": "2017 transitions into the modern style we're all used to today. The thick, flat Google logo, simple page, big buttons, and slight shadows on everything. It's sleek and gets people where they need to go quickly. And yet, the format has remained roughly the same to what it looked like nearly 20 years ago. It's both old-fashioned and modern."
            },
            {
                "year": 2019,
                "image": "wB3CGsFN.png",
                "desc": "2019 was the year that many websites took the final step in the evolution of what we consider modern design: rounded edges everywhere. There are absolutely no hard edges in this version of Google. Even the tiny squares in the waffle menu in the top right are slightly curved."
            }
        ]
    },
    {
        "name": "McDonald's",
        "children": [
            {
                "year": 1996,
                "image": "203bzdnT.png",
                "desc": "McDonald's very first version of their website represents the epitome of 90s website design, a very funky, hand-drawn website where buttons are unconventional and part of the illustrations. Clicking on the menu brought you on a fun little adventure to find the information that's so simply presented today."
            },
            {
                "year": 1997,
                "image": "kA9fTKUi.png",
                "desc": "Just one year after their first website, McDonald's completely overhauled their website, switching out the interactive style of website to the common, extremely bright, 3D asthetic of the 90s. All of the buttons are images that look 3D with bright solid backgrounds."
            },
            {
                "year": 1999,
                "image": "ZgxJFFro.png",
                "desc": "Though the website is still very vivid, McDonald's changes part of it to have a white background to make the text more readable. Though, they still retain aspects of their legacy websites, like the \"3D\" buttons and using rigid images to add some design elements."
            },
            {
                "year": 2000,
                "image": "Mwn3LUXQ.png",
                "desc": "Fascinatingly, despite its gradual shift towards a more traditional website, McDonald's completely redesigned its website for the 4th time in 5 years to adopt a funky homepage void of basically any white or black. This style of website was very common, with the buttons integrated in the images and an vivid background color. All of the buttons are images that have been edited to look 3D as was common back then."
            },
            {
                "year": 2005,
                "image": "K5t0Vp1F.png",
                "desc": "Finally, McDonald's decided to adopt a background color that wasn't bright red or yellow for the first time in 2005. It's still a wild website from a modern perspective, but this website is a perfect example of a transition between the old 90s style of fun websites to the more uniform corporate-style of website that companies were converging towards. Also, what is happening with Ronald riding on a sled of dogs?"
            },
            {
                "year": 2010,
                "image": "llLjPsTH.jpg",
                "desc": "2010 gives us the first example of McDonald's adopting a central banner with links surrounding it. It features a large image of their most recent news to make sure people see it, even if that's not the reason they came to the website. Most of the fonts on the website are more uniform and easily recognizable as well. It still has the fun elements of the early websites, pushing a story of the epic of the McRib, though, those types of elements are actively fading from the website."
            },
            {
                "year": 2018,
                "image": "FzCd0C8p.jpg",
                "desc": "Unfortunately, 2018 marked the end of fun websites from McDonald's. They finally redesigned their website to match the modern style, with the standard navigation bar pinned to the top of the screen, a consistent font with text exclusively in black or white, and honestly very little red or yellow as was so prominent in the older websites. The website even shows the start of the rounded corners era with all the buttons and text boxes."
            },
            {
                "year": 2021,
                "image": "ZSuHtNLW.jpg",
                "desc": "Most recently, McDonald's fully commits to the modern style. It now has a white background and a spaced out layout that flows really well, along with extremely corporate images. Very little remains of the old website. Everything is sleek and serves only to advertise instead of the fun the website once provided."
            }
        ]
    },
    {
        "name": "YouTube",
        "children": [
            {
                "year": 2005,
                "image": "WkpQI0S8.png",
                "desc": "The earliest version of YouTube boasted no algorithm at all. The featured videos were hand-picked by staff members to promote videos that they enjoyed watching and those videos would be shown to everyone equally. Tags are also super prominant here with inconsistent font sizes, probably to show popularity, though it's unclear why it's so inconsistent. The logo also reflects the 3D style of the old internet, adding gloss to make it appear more realistic."
            },
            {
                "year": 2006,
                "image": "q3V2h6qr.png",
                "desc": "2006 YouTube still had very little algorithm, but it added more to it than just featured videos as can be seen by the active channels and groups sections. Additionally, the home screen has a lot more options now, even including the start of a taskbar where you can switch between home, videos, etc. along with a much less prominent search bar. Though the website has grown, there's still little difference in design from the previous year."
            },
            {
                "year": 2009,
                "image": "4G017PBu.png",
                "desc": "By 2009, YouTube got rid of the slight gray background it gave to the different section groups, simplifying the appearance a little bit. It also introduces the start of a trending section by displaying what videos were most popular at the moment. The website looks a lot cleaner with less variation in its coloring (ignoring thumbnails, of course) to make everything appear more clean."
            },
            {
                "year": 2012,
                "image": "6tg30LAG.png",
                "desc": "2012 shows a massive overhaul in the YouTube website, from a logo change that's darker to be easier on the eyes but still slightly 3D, to the addition of a sidebar. Also, most importantly, a single large banner that's nearly impossible for anyone to miss, which a lot of websites at the time were starting to adopt. Additionally, there's a large emphasis on creating an account, an aspect of websites that companies started to realize was really helpful for user retention."
            },
            {
                "year": 2013,
                "image": "tYL8L3ZP.png",
                "desc": "2013 cleans up the previous year's redesign, undoing its jarring black sidebar into the cleaner white background all around. Additionally, it shows a shift to a focus on thumbnail images instead of text, which websites have started to realize grabs user attention more than text does. We can also see a verification checkmark for the first time here, which just started to become a huge deal as it was a simple way for people to recognize if an account was real or a fraud."
            },
            {
                "year": 2020,
                "image": "0iBIikwl.jpg",
                "desc": "2020 shows few differences in the past decades to the general layout, but it shows significant changes in the appearence of each element of the website. Blacks and whites are used much more than red now. For example, selecint a button turns it a light gray instead of red like the old versions of the website did. Recommended videos are the first videos to be shown to the user, demonstrating the new importance of the algorithm to user retention. Overall, the page is sleek and inoffensive and is heavily engineered to make it easy on the user to find anything they want in one glance."
            },
            {
                "year": 2022,
                "image": "DVRlYcS9.jpg",
                "desc": "Very little changed in the website in the past few years, except for changing the one aspect that every website in existance has started to adopt for the signature modern feel: Rounded corners. Everything is rounded, the thumbnails, the text box, even the highlight showing which tab is selected. It's a change that affects almost every aspect of the website but is really hard to spot unless actively looking for it, yet it is absolutely crucial for the website to feel modern."
            }
        ]
    }
]